html/rust/fp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>闭包和迭代器</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="grep_example.html"> UP </a>
 |
 <a accesskey="H" href="rust.html"> HOME </a>
</div><div id="content">
<h1 class="title">闭包和迭代器</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4fce61b">闭包：可以捕获环境的匿名函数</a>
<ul>
<li><a href="#orga5deb2a">使用闭包创建行为的抽象</a>
<ul>
<li><a href="#org8a1fba0">使用函数重构</a></li>
<li><a href="#org4055887">重构使用闭包储存代码</a></li>
</ul>
</li>
<li><a href="#org8c97317">闭包类型推断和注解</a></li>
<li><a href="#org89e6428">使用带有泛型和 Fn trait 的闭包</a></li>
<li><a href="#org9404084">闭包会捕获其环境</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Rust 的设计灵感来源于很多现存的语言和技术。其中一个显著的影响就是 <span class="underline">函数式编程</span> 。通常包含：
</p>
<ul class="org-ul">
<li>将函数作为 <span class="underline">参数值</span> 或其他函数的 <span class="underline">返回值</span></li>
<li>将函数赋值给 <span class="underline">变量</span> 以供之后执行</li>
<li>&#x2026;&#x2026;</li>
</ul>

<pre class="example">
本章不会讨论函数式编程是或不是什么的问题，而是展示 Rust 的一些在功能上与其他被认为是函数式语言类似的特性
</pre>
<p>
更具体的，将要涉及：
</p>
<ul class="org-ul">
<li><span class="underline">闭包</span> ：一个可以储存在变量里的类似函数的结构</li>
<li><span class="underline">迭代器</span> ：一种处理元素序列的方式</li>
<li>如何使用这些功能来改进前面的minigrep项目</li>
<li>这两个功能的性能</li>
</ul>

<pre class="example">
  还有其它受函数式风格影响的 Rust 功能，比如模式匹配和枚举，这些已经在其他章节中讲到过了

  掌握闭包和迭代器则是编写符合语言风格的高性能 Rust 代码的重要一环，所以将专门用一整章来讲解他们
</pre>
<div id="outline-container-org4fce61b" class="outline-2">
<h2 id="org4fce61b">闭包：可以捕获环境的匿名函数</h2>
<div class="outline-text-2" id="text-org4fce61b">
<p>
Rust 的 <span class="underline">闭包</span> 是可以 <b>保存</b> 进 <span class="underline">变量</span> 或作为 <span class="underline">参数传递</span> 给其他函数的 <b>匿名函数</b> ：
</p>
<ul class="org-ul">
<li>可以在一个地方 <b>创建</b> 闭包，然后在 <span class="underline">不同的上下文</span> 中 <b>执行</b> <span class="underline">闭包运算</span></li>
<li>不同于函数，闭包允许 <b>捕获</b> <span class="underline">调用者作用域</span> 中的值</li>
</ul>

<p>
接下来将展示闭包的这些功能如何复用代码和自定义行为
</p>
</div>
<div id="outline-container-orga5deb2a" class="outline-3">
<h3 id="orga5deb2a">使用闭包创建行为的抽象</h3>
<div class="outline-text-3" id="text-orga5deb2a">
<pre class="example">
  考虑一下这个假想的情况：在一个通过 app 生成自定义健身计划的初创企业工作，其后端使用 Rust 编写

  生成健身计划的算法需要考虑很多不同的因素，比如用户的年龄、身体质量指数、用户喜好、最近的健身活动和用户指定的强度系数

  本例中实际的算法并不重要，重要的是这个计算只花费几秒钟。但希望在需要时调用算法，并且只希望调用一次，这样就不会让用户等得太久
</pre>

<p>
这里将通过调用 simulated_expensive_calculation 函数来模拟调用假象的算法，它会打印出 calculating slowly&#x2026;，等待两秒，并接着返回传递给它的数字：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">use</span> <span style="color: #7fffd4;">std</span>::thread;
<span style="color: #00ffff;">use</span> <span style="color: #7fffd4;">std</span>::<span style="color: #7fffd4;">time</span>::<span style="color: #98fb98;">Duration</span>;

<span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">simulated_expensive_calculation</span>(<span style="color: #eedd82;">intensity</span>: <span style="color: #98fb98;">u32</span>) -&gt; <span style="color: #98fb98;">u32</span> {
    <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"calculating slowly..."</span>);
    <span style="color: #7fffd4;">thread</span>::sleep(<span style="color: #98fb98;">Duration</span>::from_secs(2));
    intensity
}
</pre>
</div>

<p>
接下来，main 函数中将会包含本例的健身 app 中的重要部分。这代表当用户请求健身计划时 app 会调用的代码。因为与 app 前端的交互与闭包的使用并不相关，所以将硬编码代表程序输入的值并打印输出。所需的输入有这些：
</p>
<ul class="org-ul">
<li>一个来自用户的 intensity 数字，请求健身计划时指定，它代表用户喜好低强度还是高强度健身</li>
<li>一个随机数，其会在健身计划中生成变化</li>
</ul>

<p>
程序的输出将会是建议的锻炼计划。下面展示了将要使用的 main 函数：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">main</span>() {
    <span style="color: #00ffff;">let</span> <span style="color: #eedd82;">simulated_user_specified_value</span> = 10;
    <span style="color: #00ffff;">let</span> <span style="color: #eedd82;">simulated_random_number</span> = 7;

    generate_workout(
        simulated_user_specified_value,
        simulated_random_number
    );
}
</pre>
</div>

<pre class="example">
  出于简单考虑这里硬编码了 simulated_user_specified_value 变量的值为 10 和 simulated_random_number 变量的值为 7

  一个实际的程序会从 app 前端获取强度系数并使用 rand crate 来生成随机数，main 函数使用模拟的输入值调用 generate_workout 函数
</pre>

<p>
现在有了执行上下文，开始编写算法。下面的 generate_workout 函数包含最关心的 app 业务逻辑。本例中余下的代码修改都将在这个函数中进行：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">generate_workout</span>(<span style="color: #eedd82;">intensity</span>: <span style="color: #98fb98;">u32</span>, <span style="color: #eedd82;">random_number</span>: <span style="color: #98fb98;">u32</span>) {
    <span style="color: #00ffff;">if</span> intensity &lt; 25 {
        <span style="color: #b0c4de;">println!</span>(
            <span style="color: #ffa07a;">"Today, do </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;"> pushups!"</span>,
            simulated_expensive_calculation(intensity)
        );
        <span style="color: #b0c4de;">println!</span>(
            <span style="color: #ffa07a;">"Next, do </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;"> situps!"</span>,
            simulated_expensive_calculation(intensity)
        );
    } <span style="color: #00ffff;">else</span> {
        <span style="color: #00ffff;">if</span> random_number == 3 {
            <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"Take a break today! Remember to stay hydrated!"</span>);
        } <span style="color: #00ffff;">else</span> {
            <span style="color: #b0c4de;">println!</span>(
                <span style="color: #ffa07a;">"Today, run for </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;"> minutes!"</span>,
                simulated_expensive_calculation(intensity)
            );
        }
    }
}
</pre>
</div>

<p>
generate_workout 函数的期望行为是首先检查用户需要低强度（由小于 25 的系数表示）锻炼还是高强度（25 或以上）锻炼：
</p>
<ul class="org-ul">
<li>低强度锻炼计划会根据由 simulated_expensive_calculation 函数所模拟的复杂算法建议一定数量的俯卧撑和仰卧起坐</li>
<li>如果用户需要高强度锻炼，这里有一些额外的逻辑：
<ul class="org-ul">
<li>如果 app 生成的随机数刚好是 3，app 相反会建议用户稍做休息并补充水分</li>
<li>如果不是，则用户会从复杂算法中得到数分钟跑步的高强度锻炼计划</li>
</ul></li>
</ul>

<p>
这里有多处调用了慢计算函数 simulated_expensive_calculation ：
</p>
<ul class="org-ul">
<li>第一个 if 块调用了 simulated_expensive_calculation 两次，else 中的 if 没有调用它</li>
<li>而第二个 else 中的代码调用了它一次</li>
</ul>

<pre class="example">
  现在这份代码能够应对需求了，但数据科学部门的同学告知将来会对调用 simulated_expensive_calculation 的方式做出一些改变

  为了在要做这些改动的时候简化更新步骤，将重构代码来让它只调用 simulated_expensive_calculation 一次

  同时还希望去掉目前多余的连续两次函数调用，并不希望在计算过程中增加任何其他此函数的调用

  也就是说，不希望在完全无需其结果的情况调用函数，不过仍然希望只调用函数一次
</pre>
</div>
<div id="outline-container-org8a1fba0" class="outline-4">
<h4 id="org8a1fba0">使用函数重构</h4>
<div class="outline-text-4" id="text-org8a1fba0">
<p>
有多种方法可以重构此程序。首先尝试的是将重复的 <span class="underline">simulated_expensive_calculation 函数调用</span> <b>提取</b> 到一个 <span class="underline">变量</span> 中： 
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">generate_workout</span>(<span style="color: #eedd82;">intensity</span>: <span style="color: #98fb98;">u32</span>, <span style="color: #eedd82;">random_number</span>: <span style="color: #98fb98;">u32</span>) {
    <span style="color: #00ffff;">let</span> <span style="color: #eedd82;">expensive_result</span> =
        simulated_expensive_calculation(intensity);

    <span style="color: #00ffff;">if</span> intensity &lt; 25 {
        <span style="color: #b0c4de;">println!</span>(
            <span style="color: #ffa07a;">"Today, do </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;"> pushups!"</span>,
            expensive_result
        );
        <span style="color: #b0c4de;">println!</span>(
            <span style="color: #ffa07a;">"Next, do </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;"> situps!"</span>,
            expensive_result
        );
    } <span style="color: #00ffff;">else</span> {
        <span style="color: #00ffff;">if</span> random_number == 3 {
            <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"Take a break today! Remember to stay hydrated!"</span>);
        } <span style="color: #00ffff;">else</span> {
            <span style="color: #b0c4de;">println!</span>(
                <span style="color: #ffa07a;">"Today, run for </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;"> minutes!"</span>,
                expensive_result
            );
        }
    }
}
</pre>
</div>

<pre class="example">
  这个修改统一了 simulated_expensive_calculation 调用并解决了第一个 if 块中不必要的两次调用函数的问题

  不幸的是，现在所有的情况下都需要调用函数并等待结果，包括那个完全不需要这一结果的内部 if 块
</pre>

<p>
希望能够在程序的一个位置指定某些代码，并只在程序的某处 <span class="underline">实际需要结果</span> 的时候 <b>执行</b> 这些 <span class="underline">代码</span> 。这正是闭包的用武之地！
</p>
</div>
</div>
<div id="outline-container-org4055887" class="outline-4">
<h4 id="org4055887">重构使用闭包储存代码</h4>
<div class="outline-text-4" id="text-org4055887">
<p>
不同于总是在 if 块之前调用 simulated_expensive_calculation 函数并储存其结果，可以定义一个闭包并将其储存在变量中，如下所示。实际上可以选择将整个 simulated_expensive_calculation 函数体移动到这里引入的闭包中：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">expensive_closure</span> = |num| {
    <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"calculating slowly..."</span>);
    <span style="color: #7fffd4;">thread</span>::sleep(<span style="color: #98fb98;">Duration</span>::from_secs(2));
    num
};
</pre>
</div>

<p>
闭包定义是 expensive_closure 赋值的 = 之后的部分：
</p>
<ul class="org-ul">
<li>闭包的定义以一对竖线 <span class="underline">|</span> 开始</li>
<li>在竖线中指定闭包的 <b>参数</b></li>
</ul>
<pre class="example">
  之所以选择这个语法是因为它与 Smalltalk 和 Ruby 的闭包定义类似

  这个闭包有一个参数 num；如果有多于一个参数，可以使用逗号分隔，比如 |param1, param2|
</pre>
<ul class="org-ul">
<li>参数之后是存放 <b>闭包体</b> 的 <span class="underline">大括号</span> ，如果闭包体只有一行则大括号是可以省略的</li>
<li>闭包体的最后一行没有分号（正如函数体一样），所以闭包体最后一行的 <span class="underline">num</span> 作为调用闭包时的 <span class="underline">返回值</span></li>
<li>大括号之后闭包的结尾，需要用于 <span class="underline">let 语句的分号</span></li>
</ul>

<pre class="example">
  注意：这个 let 语句意味着 expensive_closure 包含一个匿名函数的定义，而不是调用匿名函数的 返回值

  回忆一下使用闭包的原因是需要在一个位置定义代码，储存代码，并在之后的位置实际调用它

  所以这里期望调用的代码现在储存在 expensive_closure 变量中
</pre>

<p>
定义了闭包之后，可以改变 if 块中的代码来调用闭包以执行代码并获取结果值。调用闭包类似于 <span class="underline">调用函数</span> ；指定存放闭包定义的变量名并后跟包含期望使用的参数的括号，如下面所示： 
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">generate_workout</span>(<span style="color: #eedd82;">intensity</span>: <span style="color: #98fb98;">u32</span>, <span style="color: #eedd82;">random_number</span>: <span style="color: #98fb98;">u32</span>) {
    <span style="color: #00ffff;">let</span> <span style="color: #eedd82;">expensive_closure</span> = |num| {
        <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"calculating slowly..."</span>);
        <span style="color: #7fffd4;">thread</span>::sleep(<span style="color: #98fb98;">Duration</span>::from_secs(2));
        num
    };

    <span style="color: #00ffff;">if</span> intensity &lt; 25 {
        <span style="color: #b0c4de;">println!</span>(
            <span style="color: #ffa07a;">"Today, do </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;"> pushups!"</span>,
            expensive_closure(intensity)
        );
        <span style="color: #b0c4de;">println!</span>(
            <span style="color: #ffa07a;">"Next, do </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;"> situps!"</span>,
            expensive_closure(intensity)
        );
    } <span style="color: #00ffff;">else</span> {
        <span style="color: #00ffff;">if</span> random_number == 3 {
            <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"Take a break today! Remember to stay hydrated!"</span>);
        } <span style="color: #00ffff;">else</span> {
            <span style="color: #b0c4de;">println!</span>(
                <span style="color: #ffa07a;">"Today, run for </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;"> minutes!"</span>,
                expensive_closure(intensity)
            );
        }
    }
}
</pre>
</div>

<p>
现在耗时的计算只在一个地方被调用，并只会在需要结果的时候执行改代码
</p>

<pre class="example">
  然而，这里又重新引入了上面已经解决的问题：仍然在第一个 if 块中调用了闭包两次，这调用了慢计算代码两次而使得用户需要多等待一倍的时间

  可以通过在 if 块中创建一个本地变量存放闭包调用的结果来解决这个问题，不过闭包可以提供另外一种解决方案

  稍后会讨论这个方案，不过目前首先讨论一下为何闭包定义中和所涉及的 trait 中没有类型注解
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c97317" class="outline-3">
<h3 id="org8c97317">闭包类型推断和注解</h3>
<div class="outline-text-3" id="text-org8c97317">
<p>
闭包不要求像 fn 函数那样在 <span class="underline">参数</span> 和 <span class="underline">返回值</span> 上 <b>注明</b> <span class="underline">类型</span> 
</p>

<pre class="example">
  函数中需要类型注解是因为他们是暴露给用户的显式接口的一部分，严格的定义这些接口对于保证所有人都认同函数使用和返回值的类型来说是很重要的

  但是闭包并不用于这样暴露在外的接口：他们储存在变量中并被使用，不用命名他们或暴露给库的用户调用

  闭包通常很短并只与对应相对任意的场景较小的上下文中。在这些有限制的上下文中，编译器能可靠的推断参数和返回值的类型，类似于它是如何能够推断大部分变量的类型一样

  强制在这些小的匿名函数中注明类型是很恼人的，并且与编译器已知的信息存在大量的重复
</pre>

<p>
类似于变量，如果相比严格的必要性更希望增加明确性并变得更啰嗦，可以选择增加类型注解：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">expensive_closure</span> = |<span style="color: #eedd82;">num</span>: <span style="color: #98fb98;">u32</span>| -&gt; <span style="color: #98fb98;">u32</span> {
    <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"calculating slowly..."</span>);
    <span style="color: #7fffd4;">thread</span>::sleep(<span style="color: #98fb98;">Duration</span>::from_secs(2));
    num
};
</pre>
</div>

<p>
有了类型注解闭包的语法就更类似函数了。如下是一个对其参数加一的函数的定义与拥有相同行为闭包语法的纵向对比：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">fn</span>  <span style="color: #87cefa;">add_one_v1</span>   (<span style="color: #eedd82;">x</span>: <span style="color: #98fb98;">u32</span>) -&gt; <span style="color: #98fb98;">u32</span> { x + 1 }
<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">add_one_v2</span> = |<span style="color: #eedd82;">x</span>: <span style="color: #98fb98;">u32</span>| -&gt; <span style="color: #98fb98;">u32</span> { x + 1 };
<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">add_one_v3</span> = |x|             { x + 1 };
<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">add_one_v4</span> = |x|               x + 1  ;
</pre>
</div>

<pre class="example">
这展示了闭包语法如何类似于函数语法，除了使用竖线而不是括号以及几个可选的语法之外

1. 第一行展示了一个函数定义
2. 第二行展示了一个完整标注的闭包定义
3. 第三行闭包定义中省略了类型注解
4. 第四行去掉了可选的大括号，因为闭包体只有一行

这些都是有效的闭包定义，并在调用时产生相同的行为

这里增加了一些空格来对齐相应部分
</pre>

<p>
闭包定义会为每个参数和返回值推断一个具体类型。例如，下面展示了仅仅将参数作为返回值的简短的闭包定义
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">example_closure</span> = |x| x;

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">s</span> = example_closure(<span style="color: #98fb98;">String</span>::from(<span style="color: #ffa07a;">"hello"</span>));
<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">n</span> = example_closure(5);
</pre>
</div>

<p>
如果尝试调用闭包两次，第一次使用 String 类型作为参数而第二次使用 u32，则会得到一个错误：
</p>

<div class="org-src-container">
<pre class="src src-sh">error[E0308]: mismatched types
 --&gt; src/main.rs
  |
  | <span style="color: #b0c4de;">let</span> n = example_closure(5);
  |                         ^ expected struct <span style="color: #fa8072;">`std::string::String`</span>, found
  integer
  |
  = note: expected type <span style="color: #fa8072;">`std::string::String`</span>
             found type <span style="color: #fa8072;">`{integer}`</span>
</pre>
</div>

<pre class="example">
  第一次使用 String 值调用 example_closure 时，编译器推断 x 和此闭包返回值的类型为 String

  接着这些类型被锁定进闭包 example_closure 中，如果尝试对同一闭包使用不同类型则会得到类型错误
</pre>
</div>
</div>

<div id="outline-container-org89e6428" class="outline-3">
<h3 id="org89e6428">使用带有泛型和 Fn trait 的闭包</h3>
</div>

<div id="outline-container-org9404084" class="outline-3">
<h3 id="org9404084">闭包会捕获其环境</h3>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
